/**
 * 1 & 1 == 1   1 ^ 1 = 0
 * 1 & 0  == 1  1 ^ 0 = 1
 * 0 && 0 == 0  0 ^ 0 = 0
 * 
 * 1 + 1 = 10
 * 1 + 0 = 1
 * 0 + 0 = 0
 * 
 * case1：
 * 1+1 = 10
 * 1 ^ 1 = 0
 * (1 & 1) << 1 = 10
 * 两者相加也就等于1+1
 * 
 * case2：
 * 1+0 = 1
 * 1 ^ 0 = 1
 * (1 & 0) << 1 = 00
 * 两者相加也就等于1+0
 * 
 * case3：
 * 0+0 = 0
 * 0 ^ 0 = 0
 * (0 & 0) << 1 = 00
 * 两者相加也就等于1+0
 * 
 * 所以当扩展到不止一位的时候，也是类似的道理：a + b == (a & b) << 1 + a ^ b
 */


class Solution {
    public int getSum(int a, int b) {
        if (a == 0)
            return b;
        else if (b == 0)
            return a;
        return getSum((a & b) << 1, a ^ b);
    }
}